[AdvGeneralM1 X2CharacterTemplate]
strCharacterName="制式"

[AdvGeneralM2 X2CharacterTemplate]
strCharacterName="高级将军"

[AdvGeneralM3 X2CharacterTemplate]
strCharacterName="精英将军"

[AdvGeneralM2B X2CharacterTemplate]
strCharacterName="皇家君主"

[AdvGeneralM3B X2CharacterTemplate]
strCharacterName="皇家君主"

[AdvHonorGuardM2 X2CharacterTemplate]
strCharacterName="荣誉卫队"

[AdvHonorGuardM3 X2CharacterTemplate]
strCharacterName="精英仪仗队"

[AdvHonorGuardLMGM3 X2CharacterTemplate]
strCharacterName="精英仪仗队"

[AdvHonorGuardSwordM2 X2WeaponTemplate]
FriendlyName="变种人激光剑"

[AdvHonorGuardSwordM3 X2WeaponTemplate]
FriendlyName="变种人激光剑"

[AdvGeneralLaserM2_WPN X2WeaponTemplate]
FriendlyName="变种人激光步枪"
FriendlyNamePlural="变种人激光步枪"
BriefSummary="变种人激光步枪是变种人尖端技术的下一步。变种人激光技术可提高伤害输出，减少后坐力，实现更精准的瞄准。"
TacticalText="<Bullet/>变种人激光步枪比传统的弹匣武器威力更大。\n<Bullet/> 后坐力更小，可实现精确瞄准。"
AbilityDescName="突击步枪"

[AdvGeneralLaserM3_WPN X2WeaponTemplate]
FriendlyName="变种人激光步枪"
FriendlyNamePlural="变种人激光步枪"
BriefSummary="变种人激光步枪是变种人尖端技术的下一步。变种人激光技术可提高伤害输出，减少后坐力，实现更精准的瞄准。"
TacticalText="<Bullet/>变种人激光步枪比传统的弹匣武器威力更大。\n<Bullet/> 后坐力更小，可实现精确瞄准。"
AbilityDescName="突击步枪"

[AdvLaserRifleM2_WPN X2WeaponTemplate]
FriendlyName="变种人激光步枪"
FriendlyNamePlural="变种人激光步枪"
BriefSummary="变种人激光步枪是变种人尖端技术的下一步。变种人激光技术可提高伤害输出，减少后坐力，实现更精准的瞄准。"
TacticalText="<Bullet/>变种人激光步枪比传统的弹匣武器威力更大。\n<Bullet/> 后坐力更小，可实现精确瞄准。"
AbilityDescName="突击步枪"

[AdvLaserRifleM3_WPN X2WeaponTemplate]
FriendlyName="变种人激光步枪"
FriendlyNamePlural="变种人激光步枪"
BriefSummary="变种人激光步枪是变种人尖端技术的下一步。变种人激光技术可提高伤害输出，减少后坐力，实现更精准的瞄准。"
TacticalText="<Bullet/>变种人激光步枪比传统的弹匣武器威力更大。\n<Bullet/> 后坐力更小，可实现精确瞄准。"
AbilityDescName="突击步枪"

[AdvLaserLMGM3_WPN X2WeaponTemplate]
FriendlyName="变种人激光炮"
FriendlyNamePlural="变种人激光炮"
BriefSummary="变种人激光炮是变种人尖端技术的下一步。变种人激光技术可提高伤害输出，减少后坐力，实现更精准的瞄准。"
TacticalText="<Bullet/>变种人激光炮比传统的磁武器威力更大。\n<Bullet/> 后坐力更小，可实现精确瞄准。"
AbilityDescName="大炮"

[AdvGeneralPistolM1_WPN X2WeaponTemplate]
FriendlyName="变种人制式手枪"
FriendlyNamePlural="变种人制式手枪"
BriefSummary="作为变种人将军的随身武器，这把手枪融合了更高级别的外星科技。这是一种拥有光束般威力的磁力武器。"
TacticalText="<Bullet/>变种人制式手枪是变种人最强大的手枪之一。\n<Bullet/> 只需一次操作即可发射。"
AbilityDescName="手枪"

[AdvGeneralPistolM2_WPN X2WeaponTemplate]
FriendlyName="变种人制式手枪"
FriendlyNamePlural="变种人制式手枪"
BriefSummary="作为变种人将军的随身武器，这把手枪融合了更高级别的外星科技。这是一种拥有光束般威力的磁力武器。"
TacticalText="<Bullet/> =变种人制式手枪是变种人最强大的手枪之一。\n<Bullet/> 只需一次操作即可发射。"
AbilityDescName="手枪"

[AdvGeneralPistolM3_WPN X2WeaponTemplate]
FriendlyName="变种人制式手枪"
FriendlyNamePlural="变种人制式手枪"
BriefSummary="作为变种人将军的随身武器，这把手枪融合了更高级别的外星科技。这是一种拥有光束般威力的磁力武器。"
TacticalText="<Bullet/>变种人制式手枪是变种人最强大的手枪之一。\n<Bullet/> 只需一次操作即可发射。"
AbilityDescName="手枪"

[GoldenPistol_WPN X2WeaponTemplate]
FriendlyName="<font color='#E1C20D'>变种人黄金金洛克手枪</font>"
FriendlyNamePlural="<font color='#E1C20D'>变种人黄金洛克手枪</font>"
BriefSummary="变种人型号洛克-90黄金手枪是一把融合了更高外星科技的手枪。它是一种具有光束般威力的磁力武器。"
TacticalText="<Bullet/> 变种人制式手枪是变种人最强大的手枪之一。\n<Bullet/> 可以一次性射击，提高瞄准和暴击几率。\n<Bullet/> 稀有，在黑市上备受追捧。"
AbilityDescName="手枪"


[CallAdvReinforcementsM1 X2AbilityTemplate]
LocFriendlyName="变种人增援部队"
LocLongDescription="呼叫变种人增援。"
LocHelpText="呼叫变种人增援部队。"
LocFlyOverText="我现在需要增援！"

[CallAdvReinforcementsM2 X2AbilityTemplate]
LocFriendlyName="变种人增援部队"
LocLongDescription="呼叫变种人增援。"
LocHelpText="呼叫变种人增援部队。"
LocFlyOverText="我现在需要增援！"

[CallAdvReinforcementsM3 X2AbilityTemplate]
LocFriendlyName="变种人增援部队"
LocLongDescription="呼叫变种人增援。"
LocHelpText="呼叫变种人增援部队。"
LocFlyOverText="我现在需要增援！"

[CallAdvReinforcementsM2B X2AbilityTemplate]
LocFriendlyName="变种人荣誉卫队增援部队"
LocLongDescription="呼叫变种人荣誉卫队增援。"
LocHelpText="呼叫变种人荣誉卫队。"
LocFlyOverText="放下荣誉卫队！"

[CallAdvReinforcementsM3B X2AbilityTemplate]
LocFriendlyName="变种人荣誉卫队增援部队"
LocLongDescription="呼叫变种人荣誉卫队增援。"
LocHelpText="呼叫变种人荣誉卫队。"
LocFlyOverText="放下荣誉卫队！"

[GeneralM1Buff X2AbilityTemplate]
LocFriendlyName="将军的呐喊"
LocLongDescription="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御和 +10 意志。持续 2 个回合。"
LocHelpText="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御和 +10 意志。持续 2 个回合。"
LocFlyOverText="长老们要求你们忠诚！奋起战斗！！"

[GeneralM2Buff X2AbilityTemplate]
LocFriendlyName="将军的呐喊"
LocLongDescription="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御、+10 意志和 +5 攻击。持续 2 个回合。"
LocHelpText="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御、+10 意志和 +5 攻击。持续 2 个回合。"
LocFlyOverText="长老们要求你们忠诚！奋起战斗！！"

[GeneralM3Buff X2AbilityTemplate]
LocFriendlyName="将军的呐喊"
LocLongDescription="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御、+10 意志、+5 攻击和 +2 机动性。持续 2 个回合。"
LocHelpText="变种人将军的集结号角将增强附近的所有变种人。提供 +10 防御、+10 意志、+5 攻击和 +2 机动性。持续 2 个回合。"
LocFlyOverText="长老们要求你们忠诚！奋起战斗！！"

[HGDemolitionShot X2AbilityTemplate]
LocFriendlyName="集火射击"
LocLongDescription="向目标的掩体发射一轮齐射，严重损坏或摧毁它。不会对你的目标造成伤害。"
LocHelpText="向目标的掩体开火，严重损坏或摧毁它。不会对目标造成伤害。"
LocFlyOverText="集火射击"
LocPromotionPopupText="<Bullet/> 爆破射击需要 <Ability:SelfAmmoCost/> 弹药点数，并且具有 <Ability:SelfCooldown/> 回合冷却时间。<br/><Bullet/> 爆破射击会造成更大的环境伤害，并且会摧毁大多数掩护物体。<br/>"
LocMissMessage="错过！"

[HonorGuardLaserSlash X2AbilityTemplate]
LocFriendlyName="激光斩击"
LocLongDescription="对目标进行砍击并造成火焰伤害，会对单个目标附加燃烧效果以及迷失方向效果。"
LocHelpText="对单个目标进行攻击。"
LocFlyOverText="对目标进行砍击。"